using UnityEngine;
using System;

public class DjText
{

    public static String tip1 = "生活在青藏高原上的藏羚羊既古老又神秘，\n栖息于海拔4600-6000米的荒漠草甸高原、高原草原等环境中,\n它们早晚觅食，善奔跑，要凭借的丰富经验和善于观察的洞察力，\n才能看见这些高原上的小精灵。让我们来一起寻找它们吧！";
    
    public static String tip2 = "从区域1开始出发，现在我们只能去区域2和区域5，其中1->2距离为10，1->5距离为5，我们选择路程更短的吧！输入m表示不可达哦！";
    public static String tip3 = "1->5路径距离相对更短，我们选择了区域5."+
    "现在找到了区域5的藏羚羊了，同时，区域3和4我们也可以通过区域5到达了。下面去寻找区域2、3、3的藏羚羊，可选择路径如下：1->2，1->5->2,1->5->3和1->5->4,选择最短的吧";


    public static String tip5 = "第2趟：1->5->4，路径距离为7，比1->2，1->5->2，1->5->3三条路径要短,所以我们先去区域4"+
    "找到区域4的藏羚羊了，接下来就只剩下区域2和区域3还没去呢，根据前面的思路继续前进吧！";


    public static String tip7 = "第3趟：1->5->2，路径距离为8为最短路径，我们就通过区域5直奔区域2"+
    "恭喜你找到区域4的藏羚羊了，就剩下最后一个区域了，继续加油吧！";

    public static String tip9 = "哇哦，有这么多条路都可以到达区域3，我们当然是选择最短的那个了！\n"+
    "安全抵达区域3，目前这片草场上所有的藏羚羊已经全部都找到了，你学会了么？再次点击提交回到主界面";

    

}